#share last layer para margin=25  training process 2-1-3-4
name: "finger_siamese_train_test_patch"
layer {
  name: "pair_data"
  type: "Data"
  top: "pair_data"
  top: "sim"
  data_param {
  source: "../fingertraintopviewshapeconldb"
 # source: "fingertraintopview2ldb"
    batch_size: 64
  }
  transform_param{
  scale: 0.00390625
  #crop_size: 144
  }
  include: { phase: TRAIN }
}
layer {
  name: "pair_data"
  type: "Data"
  top: "pair_data"
  top: "sim"
  data_param {
  #  source: "fingertesttopviewldb"
    source: "../fingertesttopviewshapeconldb"
    batch_size: 5
  }
    transform_param{
  scale: 0.00390625
  #crop_size: 144
  }
  include: { phase: TEST }
}
layer {
    name: "slice_pair"
    type: "Slice"
    bottom: "pair_data"
    top: "data"
    top: "data_p"
    slice_param {
        slice_dim: 1
        slice_point: 2
    }
}


layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
    param{ 
    name:"conv1_w"
  lr_mult:1
  }
  param{
    name:"conv1_b"
  lr_mult:2
  }
  convolution_param {
    num_output: 48
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2"
    param{
    name:"conv2_w"
  lr_mult:1
  }
  param{
  name:"conv2_b"
  lr_mult:2
  }
  convolution_param {
    num_output: 64
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu2"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv22"
  type: "Convolution"
  bottom: "pool2"
  top: "conv22"
    param{
    name:"conv22_w"
  lr_mult:1
  }
  param{
  name:"conv22_b"
  lr_mult:2
  }
  convolution_param {
    num_output: 96
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu22"
  type: "ReLU"
  bottom: "conv22"
  top: "conv22"
}
layer {
  name: "pool22"
  type: "Pooling"
  bottom: "conv22"
  top: "pool22"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv3"
  type: "Convolution"
  bottom: "pool22"
  top: "conv3"
    param{
    name:"conv3_w"
  lr_mult:1
  }
  param{
      name:"conv3_b"
  lr_mult:2
  }
  convolution_param {
    num_output: 128
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu3"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
}
layer {
  name: "pool3"
  type: "Pooling"
  bottom: "conv3"
  top: "pool3"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv4"
  type: "Convolution"
  bottom: "pool3"
  top: "conv4"
    param{
    name:"conv4_w"
  lr_mult:1
  }
  param{
      name:"conv4_b"
  lr_mult:2
  }
  convolution_param {
    num_output: 256
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu4"
  type: "ReLU"
  bottom: "conv4"
  top: "conv4"
}
layer {
  name: "pool4"
  type: "Pooling"
  bottom: "conv4"
  top: "pool4"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv5"
  type: "Convolution"
  bottom: "pool4"
  top: "conv5"
    param{
    name:"conv5_w"
  lr_mult:1
  }
  param{
      name:"conv5_b"
  lr_mult:2
  }
  convolution_param {
    num_output: 512
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu5"
  type: "ReLU"
  bottom: "conv5"
  top: "conv5"
}
layer {
  name: "ip1"
  type: "InnerProduct"
  bottom: "conv5"
  top: "ip1"
  param{
   name: "ip1_w"
  lr_mult:1
  }
  param{
    name: "ip1_b"
  lr_mult:2
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu6"
  type: "ReLU"
  bottom: "ip1"
  top: "ip1"
}




layer {
  name: "conv1_p"
  type: "Convolution"
  bottom: "data_p"
  top: "conv1_p"
   param{
    name:"conv1_w"
  lr_mult:1
  }
  param{
      name:"conv1_b"
  lr_mult:2
  }
  convolution_param {
    num_output: 48
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu1_p"
  type: "ReLU"
  bottom: "conv1_p"
  top: "conv1_p"
}
layer {
  name: "pool1_p"
  type: "Pooling"
  bottom: "conv1_p"
  top: "pool1_p"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv2_p"
  type: "Convolution"
  bottom: "pool1_p"
  top: "conv2_p"
param{
    name:"conv2_w"
  lr_mult:1
  }
  param{
      name:"conv2_b"
  lr_mult:2
  }
  convolution_param {
    num_output: 64
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu2_p"
  type: "ReLU"
  bottom: "conv2_p"
  top: "conv2_p"
}
layer {
  name: "pool2_p"
  type: "Pooling"
  bottom: "conv2_p"
  top: "pool2_p"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv22_p"
  type: "Convolution"
  bottom: "pool2_p"
  top: "conv22_p"
param{
    name:"conv22_w"
  lr_mult:1
  }
  param{
      name:"conv22_b"
  lr_mult:2
  }
  convolution_param {
    num_output: 96
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu22_p"
  type: "ReLU"
  bottom: "conv22_p"
  top: "conv22_p"
}
layer {
  name: "pool22_p"
  type: "Pooling"
  bottom: "conv22_p"
  top: "pool22_p"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv3_p"
  type: "Convolution"
  bottom: "pool22_p"
  top: "conv3_p"
param{
    name:"conv3_w"
  lr_mult:1
  }
  param{
      name:"conv3_b"
  lr_mult:2
  }
  convolution_param {
    num_output: 128
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu3_p"
  type: "ReLU"
  bottom: "conv3_p"
  top: "conv3_p"
}
layer {
  name: "pool3_p"
  type: "Pooling"
  bottom: "conv3_p"
  top: "pool3_p"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv4_p"
  type: "Convolution"
  bottom: "pool3_p"
  top: "conv4_p"
param{
    name:"conv4_w"
  lr_mult:1
  }
  param{
      name:"conv4_b"
  lr_mult:2
  }
  convolution_param {
    num_output: 256
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu4_p"
  type: "ReLU"
  bottom: "conv4_p"
  top: "conv4_p"
}
layer {
  name: "pool4_p"
  type: "Pooling"
  bottom: "conv4_p"
  top: "pool4_p"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer {
  name: "conv5_p"
  type: "Convolution"
  bottom: "pool4_p"
  top: "conv5_p"
param{
    name:"conv5_w"
  lr_mult:1
  }
  param{
      name:"conv5_b"
  lr_mult:2
  }
  convolution_param {
    num_output: 512
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu5_p"
  type: "ReLU"
  bottom: "conv5_p"
  top: "conv5_p"
}
layer {
  name: "ip1_p"
  type: "InnerProduct"
  bottom: "conv5_p"
  top: "ip1_p"
  param{
   name: "ip1_w"
  lr_mult:1
  }
  param{
    name: "ip1_b"
  lr_mult:2
  }
  inner_product_param {
    num_output: 128
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
    }
  }
}
layer {
  name: "relu6_p"
  type: "ReLU"
  bottom: "ip1_p"
  top: "ip1_p"
}



layer {
    name: "loss"
   # type: "ContrastiveParaLoss"
   # contrastive_para_loss_param {
    type: "ContrastiveLoss"
    contrastive_loss_param {
       margin: 1.0
    }
    bottom: "ip1"
    bottom: "ip1_p"
    bottom: "sim"
    top: "loss"
}
